cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C123GH6PZ.svd
        <register>
          <name>_1_CTL</name>
          <description>PWM1 Control</description>
          <addressOffset>0x00000080</addressOffset>
          <fields>
            <field>
              <name>PWM_1_CTL_ENABLE</name>
              <description>PWM Block Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_1_CTL_MODE</name>
              <description>Counter Mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_1_CTL_DEBUG</name>
              <description>Debug Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_1_CTL_LOADUPD</name>
              <description>Load Register Update Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_1_CTL_CMPAUPD</name>
              <description>Comparator A Update Mode</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_1_CTL_CMPBUPD</name>
              <description>Comparator B Update Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_1_CTL_GENAUPD</name>
              <description>PWMnGENA Update Mode</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_CTL_GENAUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_CTL_GENAUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_CTL_GENAUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_CTL_GENBUPD</name>
              <description>PWMnGENB Update Mode</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_CTL_GENBUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_CTL_GENBUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_CTL_GENBUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_CTL_DBCTLUPD</name>
              <description>PWMnDBCTL Update Mode</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_CTL_DBCTLUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_CTL_DBCTLUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_CTL_DBCTLUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_CTL_DBRISEUPD</name>
              <description>PWMnDBRISE Update Mode</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_CTL_DBRISEUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_CTL_DBRISEUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_CTL_DBRISEUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_CTL_DBFALLUPD</name>
              <description>Specifies the update mode for the PWMnDBFALL register</description>
              <bitRange>[15:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_CTL_DBFALLUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_CTL_DBFALLUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_CTL_DBFALLUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_CTL_FLTSRC</name>
              <description>Fault Condition Source</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWM_1_CTL_MINFLTPER</name>
              <description>Minimum Fault Period</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PWM_1_CTL_LATCH</name>
              <description>Latch Fault Input</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_INTEN</name>
          <description>PWM1 Interrupt and Trigger Enable</description>
          <addressOffset>0x00000084</addressOffset>
          <fields>
            <field>
              <name>PWM_1_INTEN_INTCNTZERO</name>
              <description>Interrupt for Counter=0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_1_INTEN_INTCNTLOAD</name>
              <description>Interrupt for Counter=Load</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_1_INTEN_INTCMPAU</name>
              <description>Interrupt for Counter=Comparator A Up</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_1_INTEN_INTCMPAD</name>
              <description>Interrupt for Counter=Comparator A Down</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_1_INTEN_INTCMPBU</name>
              <description>Interrupt for Counter=Comparator B Up</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_1_INTEN_INTCMPBD</name>
              <description>Interrupt for Counter=Comparator B Down</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_1_INTEN_TRCNTZERO</name>
              <description>Trigger for Counter=0</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PWM_1_INTEN_TRCNTLOAD</name>
              <description>Trigger for Counter=Load</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PWM_1_INTEN_TRCMPAU</name>
              <description>Trigger for Counter=Comparator A Up</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PWM_1_INTEN_TRCMPAD</name>
              <description>Trigger for Counter=Comparator A Down</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PWM_1_INTEN_TRCMPBU</name>
              <description>Trigger for Counter=Comparator B Up</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PWM_1_INTEN_TRCMPBD</name>
              <description>Trigger for Counter=Comparator B Down</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_RIS</name>
          <description>PWM1 Raw Interrupt Status</description>
          <addressOffset>0x00000088</addressOffset>
          <fields>
            <field>
              <name>PWM_1_RIS_INTCNTZERO</name>
              <description>Counter=0 Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_1_RIS_INTCNTLOAD</name>
              <description>Counter=Load Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_1_RIS_INTCMPAU</name>
              <description>Comparator A Up Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_1_RIS_INTCMPAD</name>
              <description>Comparator A Down Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_1_RIS_INTCMPBU</name>
              <description>Comparator B Up Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_1_RIS_INTCMPBD</name>
              <description>Comparator B Down Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_ISC</name>
          <description>PWM1 Interrupt Status and Clear</description>
          <addressOffset>0x0000008C</addressOffset>
          <fields>
            <field>
              <name>PWM_1_ISC_INTCNTZERO</name>
              <description>Counter=0 Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_1_ISC_INTCNTLOAD</name>
              <description>Counter=Load Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_1_ISC_INTCMPAU</name>
              <description>Comparator A Up Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_1_ISC_INTCMPAD</name>
              <description>Comparator A Down Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_1_ISC_INTCMPBU</name>
              <description>Comparator B Up Interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_1_ISC_INTCMPBD</name>
              <description>Comparator B Down Interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_LOAD</name>
          <description>PWM1 Load</description>
          <addressOffset>0x00000090</addressOffset>
          <fields>
            <field>
              <name>PWM_1_LOAD_LOAD</name>
              <description>Counter Load Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_COUNT</name>
          <description>PWM1 Counter</description>
          <addressOffset>0x00000094</addressOffset>
          <fields>
            <field>
              <name>PWM_1_COUNT_COUNT</name>
              <description>Counter Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_CMPA</name>
          <description>PWM1 Compare A</description>
          <addressOffset>0x00000098</addressOffset>
          <fields>
            <field>
              <name>PWM_1_CMPA_COMPA</name>
              <description>Comparator A Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_CMPB</name>
          <description>PWM1 Compare B</description>
          <addressOffset>0x0000009C</addressOffset>
          <fields>
            <field>
              <name>PWM_1_CMPB_COMPB</name>
              <description>Comparator B Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_GENA</name>
          <description>PWM1 Generator A Control</description>
          <addressOffset>0x000000A0</addressOffset>
          <fields>
            <field>
              <name>PWM_1_GENA_ACTZERO</name>
              <description>Action for Counter=0</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTZERO_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTZERO_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTZERO_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTZERO_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENA_ACTLOAD</name>
              <description>Action for Counter=Load</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTLOAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTLOAD_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTLOAD_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTLOAD_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENA_ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAU_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAU_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAU_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENA_ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAD_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAD_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAD_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENA_ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBU_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBU_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBU_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENA_ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBD_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBD_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBD_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
