cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C123GH6PZ.svd
        <register>
          <name>DC9</name>
          <description>Device Capabilities 9 ADC Digital Comparators</description>
          <addressOffset>0x00000190</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC9_ADC0DC0</name>
              <description>ADC0 DC0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC1</name>
              <description>ADC0 DC1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC2</name>
              <description>ADC0 DC2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC3</name>
              <description>ADC0 DC3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC4</name>
              <description>ADC0 DC4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC5</name>
              <description>ADC0 DC5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC6</name>
              <description>ADC0 DC6 Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC7</name>
              <description>ADC0 DC7 Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC0</name>
              <description>ADC1 DC0 Present</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC1</name>
              <description>ADC1 DC1 Present</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC2</name>
              <description>ADC1 DC2 Present</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC3</name>
              <description>ADC1 DC3 Present</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC4</name>
              <description>ADC1 DC4 Present</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC5</name>
              <description>ADC1 DC5 Present</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC6</name>
              <description>ADC1 DC6 Present</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC7</name>
              <description>ADC1 DC7 Present</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSTAT</name>
          <description>Non-Volatile Memory Information</description>
          <addressOffset>0x000001A0</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_NVMSTAT_FWB</name>
              <description>32 Word Flash Write Buffer Active</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPWD</name>
          <description>Watchdog Timer Peripheral Present</description>
          <addressOffset>0x00000300</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPWD_P0</name>
              <description>Watchdog Timer 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWD_P1</name>
              <description>Watchdog Timer 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPTIMER</name>
          <description>Timer Peripheral Present</description>
          <addressOffset>0x00000304</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPTIMER_P0</name>
              <description>Timer 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P1</name>
              <description>Timer 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P2</name>
              <description>Timer 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P3</name>
              <description>Timer 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P4</name>
              <description>Timer 4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P5</name>
              <description>Timer 5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPGPIO</name>
          <description>General-Purpose Input/Output Peripheral Present</description>
          <addressOffset>0x00000308</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPGPIO_P0</name>
              <description>GPIO Port A Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P1</name>
              <description>GPIO Port B Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P2</name>
              <description>GPIO Port C Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P3</name>
              <description>GPIO Port D Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P4</name>
              <description>GPIO Port E Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P5</name>
              <description>GPIO Port F Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P6</name>
              <description>GPIO Port G Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P7</name>
              <description>GPIO Port H Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P8</name>
              <description>GPIO Port J Present</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P9</name>
              <description>GPIO Port K Present</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P10</name>
              <description>GPIO Port L Present</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P11</name>
              <description>GPIO Port M Present</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P12</name>
              <description>GPIO Port N Present</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P13</name>
              <description>GPIO Port P Present</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P14</name>
              <description>GPIO Port Q Present</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPDMA</name>
          <description>Micro Direct Memory Access Peripheral Present</description>
          <addressOffset>0x0000030C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPDMA_P0</name>
              <description>uDMA Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPHIB</name>
          <description>Hibernation Peripheral Present</description>
          <addressOffset>0x00000314</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPHIB_P0</name>
              <description>Hibernation Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Peripheral Present</description>
          <addressOffset>0x00000318</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPUART_P0</name>
              <description>UART Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P1</name>
              <description>UART Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P2</name>
              <description>UART Module 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P3</name>
              <description>UART Module 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P4</name>
              <description>UART Module 4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P5</name>
              <description>UART Module 5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P6</name>
              <description>UART Module 6 Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P7</name>
              <description>UART Module 7 Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPSSI</name>
          <description>Synchronous Serial Interface Peripheral Present</description>
          <addressOffset>0x0000031C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPSSI_P0</name>
              <description>SSI Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPSSI_P1</name>
              <description>SSI Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPSSI_P2</name>
              <description>SSI Module 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPSSI_P3</name>
              <description>SSI Module 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPI2C</name>
          <description>Inter-Integrated Circuit Peripheral Present</description>
          <addressOffset>0x00000320</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPI2C_P0</name>
              <description>I2C Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P1</name>
              <description>I2C Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P2</name>
              <description>I2C Module 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P3</name>
              <description>I2C Module 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P4</name>
              <description>I2C Module 4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P5</name>
              <description>I2C Module 5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPUSB</name>
          <description>Universal Serial Bus Peripheral Present</description>
          <addressOffset>0x00000328</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPUSB_P0</name>
              <description>USB Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCAN</name>
          <description>Controller Area Network Peripheral Present</description>
          <addressOffset>0x00000334</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPCAN_P0</name>
              <description>CAN Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPCAN_P1</name>
              <description>CAN Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPADC</name>
          <description>Analog-to-Digital Converter Peripheral Present</description>
          <addressOffset>0x00000338</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPADC_P0</name>
              <description>ADC Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPADC_P1</name>
              <description>ADC Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPACMP</name>
          <description>Analog Comparator Peripheral Present</description>
          <addressOffset>0x0000033C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPACMP_P0</name>
              <description>Analog Comparator Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPPWM</name>
          <description>Pulse Width Modulator Peripheral Present</description>
          <addressOffset>0x00000340</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPPWM_P0</name>
              <description>PWM Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPPWM_P1</name>
              <description>PWM Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPQEI</name>
          <description>Quadrature Encoder Interface Peripheral Present</description>
          <addressOffset>0x00000344</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPQEI_P0</name>
              <description>QEI Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPQEI_P1</name>
              <description>QEI Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPEEPROM</name>
          <description>EEPROM Peripheral Present</description>
          <addressOffset>0x00000358</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPEEPROM_P0</name>
              <description>EEPROM Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPWTIMER</name>
          <description>Wide Timer Peripheral Present</description>
          <addressOffset>0x0000035C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPWTIMER_P0</name>
              <description>Wide Timer 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P1</name>
              <description>Wide Timer 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P2</name>
              <description>Wide Timer 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P3</name>
              <description>Wide Timer 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P4</name>
              <description>Wide Timer 4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P5</name>
              <description>Wide Timer 5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRWD</name>
          <description>Watchdog Timer Software Reset</description>
          <addressOffset>0x00000500</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRWD_R0</name>
              <description>Watchdog Timer 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRWD_R1</name>
              <description>Watchdog Timer 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRTIMER</name>
          <description>Timer Software Reset</description>
          <addressOffset>0x00000504</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRTIMER_R0</name>
              <description>Timer 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R1</name>
              <description>Timer 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R2</name>
              <description>Timer 2 Software Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R3</name>
              <description>Timer 3 Software Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R4</name>
              <description>Timer 4 Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R5</name>
              <description>Timer 5 Software Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRGPIO</name>
          <description>General-Purpose Input/Output Software Reset</description>
          <addressOffset>0x00000508</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRGPIO_R0</name>
              <description>GPIO Port A Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R1</name>
              <description>GPIO Port B Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R2</name>
              <description>GPIO Port C Software Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R3</name>
              <description>GPIO Port D Software Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R4</name>
              <description>GPIO Port E Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R5</name>
              <description>GPIO Port F Software Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R6</name>
              <description>GPIO Port G Software Reset</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R7</name>
              <description>GPIO Port H Software Reset</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R8</name>
              <description>GPIO Port J Software Reset</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R9</name>
              <description>GPIO Port K Software Reset</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRDMA</name>
          <description>Micro Direct Memory Access Software Reset</description>
          <addressOffset>0x0000050C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRDMA_R0</name>
              <description>uDMA Module Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRHIB</name>
          <description>Hibernation Software Reset</description>
          <addressOffset>0x00000514</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRHIB_R0</name>
              <description>Hibernation Module Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
